In [10]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
purchase = pd.read_csv('QVI_purchase_behaviour.csv')
transaction = pd.read_excel('QVI_transaction_data.xlsx')

In [18]:
from IPython.display import display, Markdown

display(Markdown('**Dataframe Head first 10 values**'))
display(purchase.head(10))
display(transaction.head(10))

display(Markdown('**Dataframe Information**'))
display(purchase.info())
display(transaction.info())

display(Markdown('**Dataframe description**'))
display(transaction.describe())

**Dataframe Head first 10 values**

   LYLTY_CARD_NBR               LIFESTAGE PREMIUM_CUSTOMER
0            1000   YOUNG SINGLES/COUPLES          Premium
1            1002   YOUNG SINGLES/COUPLES       Mainstream
2            1003          YOUNG FAMILIES           Budget
3            1004   OLDER SINGLES/COUPLES       Mainstream
4            1005  MIDAGE SINGLES/COUPLES       Mainstream
5            1007   YOUNG SINGLES/COUPLES           Budget
6            1009            NEW FAMILIES          Premium
7            1010   YOUNG SINGLES/COUPLES       Mainstream
8            1011   OLDER SINGLES/COUPLES       Mainstream
9            1012          OLDER FAMILIES       Mainstream

,DATE,STORE_NBR,LYLTY_CARD_NBR,TXN_ID,PROD_NBR,PROD_NAME,PROD_QTY,TOT_SALES
0,43390,1,1000,1,5,Natural Chip Compny SeaSalt175g,2,6.0
1,43599,1,1307,348,66,CCs Nacho Cheese 175g,3,6.3
2,43605,1,1343,383,61,Smiths Crinkle Cut Chips Chicken 170g,2,2.9
3,43329,2,2373,974,69,Smiths Chip Thinly S/Cream&Onion 175g,5,15.0
4,43330,2,2426,1038,108,Kettle Tortilla ChpsHny&Jlpno Chili 150g,3,13.8
5,43604,4,4074,2982,57,Old El Paso Salsa Dip Tomato Mild 300g,1,5.1
6,43601,4,4149,3333,16,Smiths Crinkle Chips Salt & Vinegar 330g,1,5.7
7,43601,4,4196,3539,24,Grain Waves Sweet Chilli 210g,1,3.6
8,43332,5,5026,4525,42,Doritos Corn Chip Mexican Jalapeno 150g,1,3.9
9,43330,7,7150,6900,52,Grain Waves Sour Cream&Chives 210G,2,7.2

**Dataframe Information**

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72637 entries, 0 to 72636
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   LYLTY_CARD_NBR    72637 non-null  int64
 1   LIFESTAGE         72637 non-null  object
 2   PREMIUM_CUSTOMER  72637 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264836 entries, 0 to 264835
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   DATE            264836 non-null  int64
 1   STORE_NBR       264836 non-null  int64
 2   LYLTY_CARD_NBR  264836 non-null  int64
 3   TXN_ID          264836 non-null  int64
 4   PROD_NBR        264836 non-null  int64
 5   PROD_NAME       264836 non-null  object
 6   PROD_QTY        264836 non-null  int64
 7   TOT_SALES       264836 non-null  float64
dtypes: float64(1), int64(6), object(1)
memory usage: 16.2+ MB

None

**Dataframe description**

,DATE,STORE_NBR,LYLTY_CARD_NBR,TXN_ID,PROD_NBR,PROD_QTY,TOT_SALES
count,264836.000000,264836.00000,2.648360e+05,2.648360e+05,264836.000000,264836.000000,264836.000000
mean,43464.036260,135.08011,1.355495e+05,1.351583e+05,56.583157,1.907309,7.304200
std,105.389282,76.78418,8.057998e+04,7.813303e+04,32.826638,0.643654,3.083226
min,43282.000000,1.00000,1.000000e+03,1.000000e+00,1.000000,1.000000,1.500000
25%,43373.000000,70.00000,7.002100e+04,6.760150e+04,28.000000,2.000000,5.400000
50%,43464.000000,130.00000,1.303575e+05,1.351375e+05,56.000000,2.000000,7.400000
75%,43555.000000,203.00000,2.030942e+05,2.027012e+05,85.000000,2.000000,9.200000
max,43646.000000,272.00000,2.373711e+06,2.415841e+06,114.000000,200.000000,650.000000

In [19]:
merge = transaction.merge(purchase, on='LYLTY_CARD_NBR', how='outer')
merge.head(10)

,DATE,STORE_NBR,LYLTY_CARD_NBR,TXN_ID,PROD_NBR,PROD_NAME,PROD_QTY,TOT_SALES,LIFESTAGE,PREMIUM_CUSTOMER
0,43390,1,1000,1,5,Natural Chip Compny SeaSalt175g,2,6.0,YOUNG SINGLES/COUPLES,Premium
1,43359,1,1002,2,58,Red Rock Deli Chikn&Garlic Aioli 150g,1,2.7,YOUNG SINGLES/COUPLES,Mainstream
2,43531,1,1003,3,52,Grain Waves Sour Cream&Chives 210G,1,3.6,YOUNG FAMILIES,Budget
3,43532,1,1003,4,106,Natural ChipCo Hony Soy Chckn175g,1,3.0,YOUNG FAMILIES,Budget
4,43406,1,1004,5,96,WW Original Stacked Chips 160g,1,1.9,OLDER SINGLES/COUPLES,Mainstream
5,43462,1,1005,6,86,Cheetos Puffs 165g,1,2.8,MIDAGE SINGLES/COUPLES,Mainstream
6,43438,1,1007,7,49,Infuzions SourCream&Herbs Veg Strws 110g,1,3.8,YOUNG SINGLES/COUPLES,Budget
7,43439,1,1007,8,10,RRD SR Slow Rst Pork Belly 150g,1,2.7,YOUNG SINGLES/COUPLES,Budget
8,43424,1,1009,9,20,Doritos Cheese Supreme 330g,1,5.7,NEW FAMILIES,Premium
9,43352,1,1010,10,51,Doritos Mexicana 170g,2,8.8,YOUNG SINGLES/COUPLES,Mainstream

We will perform EDA, firstly on the purchase Dataframe
Since 'LYLTY_CARD_NBR' is just an ID, we will only focus on 'LIFESTAGE'	and 'PREMIUM_CUSTOMER'
Some interesting questions to ask will be:
1. What is the most and least common lifestage and premium?
2. What is the most and least common lifestage and premium combination?
3. How does lifestage affect premium?

In [56]:
#List all the unique 'LIFESTAGE' and 'PREMIUM_CUSTOMER' values
display(purchase.groupby('LIFESTAGE').size().to_frame('LIFESTAGE COUNT').sort_values('LIFESTAGE COUNT', ascending=False))
print('\n\n')
display(purchase.groupby('PREMIUM_CUSTOMER').size().to_frame('PREMIUM_CUSTOMER COUNT').sort_values('PREMIUM_CUSTOMER COUNT', ascending=False))
print('\n\n')
display(purchase.groupby(['LIFESTAGE','PREMIUM_CUSTOMER']).size().to_frame('Count').sort_values('Count', ascending=False))

                        LIFESTAGE COUNT
LIFESTAGE
RETIREES                          14805
OLDER SINGLES/COUPLES             14609
YOUNG SINGLES/COUPLES             14441
OLDER FAMILIES                     9780
YOUNG FAMILIES                     9178
MIDAGE SINGLES/COUPLES             7275
NEW FAMILIES                       2549

                  PREMIUM_CUSTOMER COUNT
PREMIUM_CUSTOMER
Mainstream                         29245
Budget                             24470
Premium                            18922

                                         Count
LIFESTAGE              PREMIUM_CUSTOMER
YOUNG SINGLES/COUPLES  Mainstream         8088
RETIREES               Mainstream         6479
OLDER SINGLES/COUPLES  Mainstream         4930
                       Budget             4929
                       Premium            4750
OLDER FAMILIES         Budget             4675
RETIREES               Budget             4454
YOUNG FAMILIES         Budget             4017
RETIREES               Premium            3872
YOUNG SINGLES/COUPLES  Budget             3779
MIDAGE SINGLES/COUPLES Mainstream         3340
OLDER FAMILIES         Mainstream         2831
YOUNG FAMILIES         Mainstream         2728
YOUNG SINGLES/COUPLES  Premium            2574
YOUNG FAMILIES         Premium            2433
MIDAGE SINGLES/COUPLES Premium            2431
OLDER FAMILIES         Premium            2274
MIDAGE SINGLES/COUPLES Budget             1504
NEW FAMILIES           Budget             1112
                       Mainstream          849
                       Premium             588

- Single people and couples are aggregated as one value
- Each category is differentiated based on age and if they have a families so the features will be determine by age (numerical values, eg. 0-99) and families(binary values, 0 or 1, yes or no)
- Premium can be list as Budget(lowest cost), Mainstream(mid cost), Premium(Highest cost)
- The trend is the older customers represent a larger portion of the customer base